#!/usr/bin/env bash

setupRobot() {
    local robot_name="$1"
    local valid_names=("bento_box" "zyklop" "schaeufele" "crabby")

    # setup ros
    source "/opt/ros/jazzy/setup.bash"
    # fix error with rviz2 on kde neon
    alias rviz2='QT_QPA_PLATFORM=xcb rviz2'

    # Validate name
    if [[ ! " ${valid_names[*]} " =~ " ${robot_name} " ]]; then
        echo "WiFi is not a robot. Connect to 'Bento-Box', 'Schaeufele', 'Zyklop' or 'Crabby'"
        return 1
    fi

    # setup xauth for Bento-Operation docker
    if ! [[ -e $HOME/.Xauthority ]]
    then
        ln -sf /run/user/1000/xauth_* ~/.Xauthority
    fi
    # set up shortcut for Bento-Operation
    alias begin_operation='docker compose -f $HOME/Code/Bento-Operation/compose.yaml up'

    export BENTO_ROBOT_NAME="$robot_name"

    # do fine art 🤌
    case "$robot_name" in
        "bento_box")
cat << EOF

    ░▒▓███████▓▒░░▒▓████████▓▒░▒▓███████▓▒░▒▓████████▓▒░▒▓██████▓▒░       ░▒▓███████▓▒░ ░▒▓██████▓▒░░▒▓█▓▒░░▒▓█▓▒░
    ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▒░  ░▒▓█▓▒░░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░
    ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▒░  ░▒▓█▓▒░░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░
    ░▒▓███████▓▒░░▒▓██████▓▒░ ░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▒░  ░▒▓█▓▒░░▒▓█▓▒░      ░▒▓███████▓▒░░▒▓█▓▒░░▒▓█▓▒░░▒▓██████▓▒░ 
    ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▒░  ░▒▓█▓▒░░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░
    ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▒░  ░▒▓█▓▒░░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░
    ░▒▓███████▓▒░░▒▓████████▓▒░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▒░   ░▒▓██████▓▒░       ░▒▓███████▓▒░ ░▒▓██████▓▒░░▒▓█▓▒░░▒▓█▓▒░
EOF
  ;;
        "schaeufele")
cat << EOF

     ░▒▓███████▓▒░░▒▓██████▓▒░░▒▓█▓▒░░▒▓█▓▒░░▒▓██████▓▒░░▒▓████████▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓████████▓▒░▒▓████████▓▒░▒▓█▓▒░      ░▒▓████████▓▒░
    ░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░      ░▒▓█▓▒░      ░▒▓█▓▒░      ░▒▓█▓▒░       
    ░▒▓█▓▒░      ░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░      ░▒▓█▓▒░      ░▒▓█▓▒░      ░▒▓█▓▒░       
     ░▒▓██████▓▒░░▒▓█▓▒░      ░▒▓████████▓▒░▒▓████████▓▒░▒▓██████▓▒░ ░▒▓█▓▒░░▒▓█▓▒░▒▓██████▓▒░ ░▒▓██████▓▒░ ░▒▓█▓▒░      ░▒▓██████▓▒░  
           ░▒▓█▓▒░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░      ░▒▓█▓▒░      ░▒▓█▓▒░      ░▒▓█▓▒░       
           ░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░      ░▒▓█▓▒░      ░▒▓█▓▒░      ░▒▓█▓▒░       
    ░▒▓███████▓▒░ ░▒▓██████▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓████████▓▒░░▒▓██████▓▒░░▒▓█▓▒░      ░▒▓████████▓▒░▒▓████████▓▒░▒▓████████▓▒░
EOF
  ;;

        "zyklop")
cat << EOF

        )                             
     ( /(           )  (              
     )\()) (     ( /(  )\             
    ((_)\  )\ )  )\())((_) (      )   
     _((_)(()/( ((_)\  _   )\  /(/(   
    |_  /  )(_))| |(_)| | ((_)((_)_\  
     / /  | || || / / | |/ _ \| '_ \) 
    /___|  \_, ||_\_\ |_|\___/| .__/  
           |__/               |_|     
EOF
  ;;


        "crabby")
cat << EOF

▗▞▀▘ ▄▄▄ ▗▞▀▜▌▗▖   ▗▖   ▄   ▄ 
▝▚▄▖█    ▝▚▄▟▌▐▌   ▐▌   █   █ 
    █         ▐▛▀▚▖▐▛▀▚▖ ▀▀▀█ 
              ▐▙▄▞▘▐▙▄▞▘▄   █ 
                         ▀▀▀  
EOF
  ;;
    esac
}

chooseWifi() {
    local wifiname
    wifiname=$(iwgetid -r 2>/dev/null)

    case "$wifiname" in
        "Bento-Box") echo "bento_box" ;;
        "Schaeufele") echo "schaeufele" ;;
        "Zyklop") echo "zyklop" ;;
        "Crabby") echo "crabby" ;;
        *)
            return 1
            ;;
    esac
}

# --- Main ---
robot_name=$(chooseWifi)
if [[ -n "$robot_name" ]]; then
    setupRobot "$robot_name"
else
    echo "Could not determine robot from Wi-Fi."
fi
